---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSideSupportType
source: html/79028813-9e08-265a-f730-777a56ea2b59.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSideSupportType Property

"Right Support Type": Right Side Support Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeRightSideSupportType { get; }
```